---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GUID
source: html/c86d0033-8200-15ee-070c-d0a606ed3b2a.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GUID Property

The GUID to use for this parameter definition.
 If not explicitly set, a random GUID is used.

## Syntax (C#)
```csharp
public Guid GUID { get; set; }
```